config.org
#+TITLE:  Emacs Configuration File
#+AUTHOR: Timo Lassmann 
#+LATEX_CLASS: report
#+OPTIONS:  toc:nil
#+OPTIONS: H:4
#+LATEX_CMD: xelatex

#+PROPERTY:    header-args:emacs-lisp  :tangle elisp/config-main.el
#+PROPERTY:    header-args:shell       :tangle no
#+PROPERTY:    header-args             :results silent   :eval no-export   :comments org

# \Author{Timo La\ss mann}
# \DocumentID{src_sh[:value verbatim]{shasum -a 256 config.org | awk '{print $1}' }}

* To speed things up 
  
  #+BEGIN_SRC emacs-lisp
    (setq gc-cons-threshold 16777216)

    (setq gc-cons-percentage 0.6)

    (setq  message-log-max 16384)

  #+END_SRC




* Package Manager
  To start we need the package "package" 

  #+BEGIN_SRC emacs-lisp
    (require 'package)

    (setq package-archives '(("org" . "https://orgmode.org/elpa/")
                             ("gnu" . "https://elpa.gnu.org/packages/")
                             ("melpa"     . "https://melpa.org/packages/")))
    (package-initialize)
  #+END_SRC

  Next let's make sure we have use-package

  #+BEGIN_SRC emacs-lisp
    (unless (package-installed-p 'use-package)
      (package-refresh-contents)
      (package-install 'use-package))
  #+END_SRC

* General Settings
** Init File Support

   Load up a collection of enhancements to Emacs Lisp, including [[https://github.com/magnars/dash.el][dash]],
   [[https://github.com/magnars/s.el][s]] for string manipulation, and [[https://github.com/rejeep/f.el][f]] for file manipulation.

   #+BEGIN_SRC emacs-lisp
     (require 'cl)

     (use-package dash
       :ensure t
       :config (eval-after-load "dash" '(dash-enable-font-lock)))

     (use-package s
       :ensure t)

     (use-package f
       :ensure t)
   #+END_SRC

** Trace for obsolete packages 

   #+BEGIN_SRC emacs-lisp
     (defun debug-on-load-obsolete (filename)
       (when (equal (car (last (split-string filename "[/\\]") 2))
                    "obsolete")
         (debug)))
     (add-to-list 'after-load-functions #'debug-on-load-obsolete)

   #+END_SRC
** Whoami 
   
   #+BEGIN_SRC emacs-lisp
     (setq user-full-name "Timo Lassmann"
           user-mail-address "timo.lassmann@telethonkids.org.au")
   #+END_SRC
   
** Emacs directory

   #+BEGIN_SRC emacs-lisp
     (defconst tl/emacs-directory (concat (getenv "HOME") "/.emacs.d/"))
     (defun tl/emacs-subdirectory (d) (expand-file-name d tl/emacs-directory))
   #+END_SRC
   
   #+BEGIN_SRC emacs-lisp
     (message "%s" (tl/emacs-subdirectory "elisp"))
     (add-to-list 'load-path (tl/emacs-subdirectory "elisp"))
   #+END_SRC

** Basic looks 
*** remove startup screen
    #+BEGIN_SRC emacs-lisp
      (setq inhibit-startup-message t) 
    #+END_SRC

*** remove bars ets 
    #+BEGIN_SRC emacs-lisp
      (tool-bar-mode -1)
      (menu-bar-mode -1)
      (scroll-bar-mode -1)
      (mouse-wheel-mode -1)
    #+END_SRC
*** Disable bell 
    #+BEGIN_SRC emacs-lisp 
      (setq ring-bell-function 'ignore)
    #+END_SRC

*** UTF-8

    #+BEGIN_SRC emacs-lisp
      (setq locale-coding-system 'utf-8)
      (set-terminal-coding-system 'utf-8)
      (set-keyboard-coding-system 'utf-8)
      (set-selection-coding-system 'utf-8)
      (prefer-coding-system 'utf-8)
    #+END_SRC

** Turn off arrow keys

   #+BEGIN_SRC emacs-lisp 

     (require 'no-easy-keys)
     (no-easy-keys 1)

   #+END_SRC
** Turn off  mouse 

   #+BEGIN_SRC emacs-lisp 
     (use-package disable-mouse
       :ensure t 
       :demand t)

     (global-disable-mouse-mode)

   #+END_SRC
** Diminish 

   #+BEGIN_SRC emacs-lisp
     (use-package diminish 
       :ensure t 
       :demand t)
   #+END_SRC

** Turn off auto-fill mode

   #+BEGIN_SRC emacs-lisp
     (setq auto-fill-mode -1)
     (setq-default fill-column 99999)
     (setq fill-column 99999)
   #+END_SRC

** Undo / redo
   According to this article, I get better functionality than the redo+ plugin (which I can’t seem to get working well).
   #+BEGIN_SRC emacs-lisp
     (use-package undo-tree
       :ensure t
       :diminish
       :init
       (global-undo-tree-mode 1)
       :config
       (defalias 'redo 'undo-tree-redo)
       :bind (("C-z" . undo)     ; Zap to character isn't helpful
              ("C-S-z" . redo)))

   #+END_SRC

** Kill this buffer
   Assume that I always want to kill the current buffer when hitting C-x k.
   #+BEGIN_SRC emacs-lisp
     (defun tl/kill-current-buffer ()
       "Kill the current buffer without prompting."
       (interactive)
       (kill-buffer (current-buffer)))
     (global-set-key (kbd "C-x k") 'tl/kill-current-buffer)
   #+END_SRC

** Tabs 
   Never use tabs. Tabs are the devil’s whitespace.

   #+BEGIN_SRC emacs-lisp
     (setq-default indent-tabs-mode nil)
     (setq tab-width 4)
     ;; (setq-default tab-always-indent 'complete)
   #+END_SRC

** Location of mactex (if we are using mac - unlikely...
   Tell emacs about the mactex installation...

   #+BEGIN_SRC emacs-lisp
     (setenv "PATH" (concat "/Library/TeX/texbin" ":" (getenv "PATH")))
   #+END_SRC

   This should do it...

** Dired settings 

   Taken from: https://github.com/munen/emacs.d


   Ability to use =a= to visit a new directory or file in dired instead of using =RET=.
   =RET= works just fine, but it will create a new buffer for every interaction
   whereas a reuses the current buffer.

   #+BEGIN_SRC emacs-lisp
     (put 'dired-find-alternate-file 'disabled nil)
     (setq-default dired-listing-switches "-alh")
   #+END_SRC

** Path 

   #+BEGIN_SRC emacs-lisp
     ;;(let ((path-from-shell (shell-command-to-string "/bin/bash -l -c 'echo $PATH'")))
     ;;  (setenv "PATH" path-from-shell)
     ;;  (setq exec-path (split-string path-from-shell path-separator)))

   #+END_SRC
   
   #+BEGIN_SRC emacs-lisp 
     (setq temporary-file-directory "/tmp")
   #+END_SRC

** Modernizing Emacs

   Found [[https://github.com/wasamasa/dotemacs/blob/master/init.org#init][here]] how to remove the warnings from the GnuTLS library when
   using HTTPS... increase the minimum prime bits size:
   #+BEGIN_SRC emacs-lisp
     (setq gnutls-min-prime-bits 4096)
   #+END_SRC

** Turn off sleep mode 
   I keep hitting this by accidental
   #+BEGIN_SRC emacs-lisp 
     (global-unset-key (kbd "C-z"))
   #+END_SRC

* Basic Functionality 
** Highligh current line

   hl-line is awesome! It’s not very awesome in the terminal version of emacs though, so we don’t use that. Besides, it’s only used for programming.
   #+BEGIN_SRC emacs-lisp
     (when window-system (add-hook 'prog-mode-hook 'hl-line-mode))
   #+END_SRC

** yes-no to y-n
   #+BEGIN_SRC emacs-lisp
     (defalias 'yes-or-no-p 'y-or-n-p)
   #+END_SRC

** Async

   Lets us use asynchronous processes wherever possible, pretty useful.
   #+BEGIN_SRC emacs-lisp
     (use-package async
       :ensure t
       :init (dired-async-mode 1))
   #+END_SRC

