config.tex
% Created 2020-02-27 Thu 18:47
% Intended LaTeX compiler: pdflatex
\documentclass[12pt]{article}
\usepackage{\string~"/.emacs.d/latex_templates/report"}
\author{Timo Lassmann}
\date{\today}
\title{Emacs Configuration File}
\hypersetup{
 pdfauthor={Timo Lassmann},
 pdftitle={Emacs Configuration File},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{To speed things up}
\label{sec:org9fcba23}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq gc-cons-threshold 16777216)

(setq gc-cons-percentage 0.6)

(setq  message-log-max 16384)

\end{minted}




\section{Package Manager}
\label{sec:orgf528126}
To start we need the package ``package'' 

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(require 'package)

(setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3")

(setq package-archives '(("org" . "https://orgmode.org/elpa/")
                         ("gnu" . "https://elpa.gnu.org/packages/")
                         ("melpa"     . "https://melpa.org/packages/")))
(package-initialize)
\end{minted}

Next let's make sure we have use-package

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
\end{minted}

\section{General Settings}
\label{sec:org74cf5b0}
\subsection{Init File Support}
\label{sec:orgf63d0a3}

Load up a collection of enhancements to Emacs Lisp, including \href{https://github.com/magnars/dash.el}{dash},
\href{https://github.com/magnars/s.el}{s} for string manipulation, and \href{https://github.com/rejeep/f.el}{f} for file manipulation.

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(require 'cl)

(use-package dash
  :ensure t
  :config (eval-after-load "dash" '(dash-enable-font-lock)))

(use-package s
  :ensure t)

(use-package f
  :ensure t)
\end{minted}

\subsection{Trace for obsolete packages}
\label{sec:orgb4f5e35}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(defun debug-on-load-obsolete (filename)
  (when (equal (car (last (split-string filename "[/\\]") 2))
               "obsolete")
    (debug)))
(add-to-list 'after-load-functions #'debug-on-load-obsolete)

\end{minted}
\subsection{Whoami}
\label{sec:org5c5cd99}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq user-full-name "Timo Lassmann"
      user-mail-address "timo.lassmann@telethonkids.org.au")
\end{minted}

\subsection{Emacs directory}
\label{sec:orgeb5a13f}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(defconst tl/emacs-directory (concat (getenv "HOME") "/.emacs.d/"))
(defun tl/emacs-subdirectory (d) (expand-file-name d tl/emacs-directory))
\end{minted}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(message "%s" (tl/emacs-subdirectory "elisp"))
(add-to-list 'load-path (tl/emacs-subdirectory "elisp"))
\end{minted}

\subsection{Basic looks}
\label{sec:org871bf07}
\subsubsection{remove startup screen}
\label{sec:org4307ef2}
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq inhibit-startup-message t) 
\end{minted}

\subsubsection{remove bars ets}
\label{sec:orgd941f9d}
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(mouse-wheel-mode -1)
\end{minted}
\subsubsection{Disable bell}
\label{sec:org292a529}
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq ring-bell-function 'ignore)
\end{minted}

\subsubsection{UTF-8}
\label{sec:org92c3a4e}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
\end{minted}

\subsection{Turn off arrow keys}
\label{sec:org5cc6b98}

\begin{minted}[frame=lines,linenos=true]{common-lisp}

(require 'no-easy-keys)
(no-easy-keys 1)

\end{minted}
\subsection{Turn off  mouse}
\label{sec:org7d180a0}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package disable-mouse
  :ensure t 
  :demand t)

(global-disable-mouse-mode)

\end{minted}
\subsection{Diminish}
\label{sec:orga93e0fc}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package diminish 
  :ensure t 
  :demand t)
\end{minted}

\subsection{Turn off auto-fill mode}
\label{sec:org0cab21e}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq auto-fill-mode -1)
(setq-default fill-column 99999)
(setq fill-column 99999)
\end{minted}

\subsection{Undo / redo}
\label{sec:org0e5cdf8}
According to this article, I get better functionality than the redo+ plugin (which I can’t seem to get working well).
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package undo-tree
  :ensure t
  :diminish
  :init
  (global-undo-tree-mode 1)
  :config
  (defalias 'redo 'undo-tree-redo)
  :bind (("C-z" . undo)     ; Zap to character isn't helpful
         ("C-S-z" . redo)))

\end{minted}

\subsection{Kill this buffer}
\label{sec:org1db48ed}
Assume that I always want to kill the current buffer when hitting C-x k.
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(defun tl/kill-current-buffer ()
  "Kill the current buffer without prompting."
  (interactive)
  (kill-buffer (current-buffer)))
(global-set-key (kbd "C-x k") 'tl/kill-current-buffer)
\end{minted}

\subsection{Tabs}
\label{sec:org52cfe1d}
Never use tabs. Tabs are the devil’s whitespace.

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq-default indent-tabs-mode nil)
(setq tab-width 4)
;; (setq-default tab-always-indent 'complete)
\end{minted}

\subsection{Location of mactex (if we are using mac - unlikely\ldots{}}
\label{sec:org30b1831}
Tell emacs about the mactex installation\ldots{}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setenv "PATH" (concat "/Library/TeX/texbin" ":" (getenv "PATH")))
\end{minted}

This should do it\ldots{}

\subsection{Dired settings}
\label{sec:orgd442a06}

Taken from: \url{https://github.com/munen/emacs.d}


Ability to use \texttt{a} to visit a new directory or file in dired instead of using \texttt{RET}.
\texttt{RET} works just fine, but it will create a new buffer for every interaction
whereas a reuses the current buffer.

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(put 'dired-find-alternate-file 'disabled nil)
(setq-default dired-listing-switches "-alh")
\end{minted}

\subsection{Path}
\label{sec:org5e0225d}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
;;(let ((path-from-shell (shell-command-to-string "/bin/bash -l -c 'echo $PATH'")))
;;  (setenv "PATH" path-from-shell)
;;  (setq exec-path (split-string path-from-shell path-separator)))

\end{minted}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq temporary-file-directory "/tmp")
\end{minted}

\subsection{Modernizing Emacs}
\label{sec:org2077e97}

Found \href{https://github.com/wasamasa/dotemacs/blob/master/init.org\#init}{here} how to remove the warnings from the GnuTLS library when
using HTTPS\ldots{} increase the minimum prime bits size:
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq gnutls-min-prime-bits 4096)
\end{minted}

\subsection{Turn off sleep mode}
\label{sec:org2d0ef56}
I keep hitting this by accidental
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(global-unset-key (kbd "C-z"))
\end{minted}

\section{Basic Functionality}
\label{sec:org47346f0}
\subsection{Highligh current line}
\label{sec:org1f184d5}

hl-line is awesome! It’s not very awesome in the terminal version of emacs though, so we don’t use that. Besides, it’s only used for programming.
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(when window-system (add-hook 'prog-mode-hook 'hl-line-mode))
\end{minted}

\subsection{yes-no to y-n}
\label{sec:orgadf45a2}
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(defalias 'yes-or-no-p 'y-or-n-p)
\end{minted}

\subsection{Async}
\label{sec:orgdcd6436}

Lets us use asynchronous processes wherever possible, pretty useful.
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package async
  :ensure t
  :init (dired-async-mode 1))
\end{minted}
