config.tex

\subsection{Projectile}
\label{sec:org9caf993}

Projectile is an awesome project manager, mostly because it recognizes directories with a .git directory as projects and helps you manage them accordingly.
Enable projectile globally

This makes sure that everything can be a project.
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package projectile
  :ensure t
  :diminish
  :init
  (projectile-mode 1))
\end{minted}

Let projectile call make

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(global-set-key (kbd "<f5>") 'projectile-compile-project)
\end{minted}

\subsection{Insert date}
\label{sec:org496599b}
This is a piece of code from JorgenSchaefersEmacsConfig.
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(defun insert-date (prefix)
  "Insert the current date. With prefix-argument, use ISO format. With
   two prefix arguments, write out the day and month name."
  (interactive "P")
  (let ((format (cond
                 ((not prefix) "%d.%m.%Y")
                 ((equal prefix '(4)) "%Y-%m-%d")
                 ((equal prefix '(16)) "%A, %d. %B %Y")))
        (system-time-locale "en_US.UTF-8"))
    (insert (format-time-string format))))

(global-set-key (kbd "C-c d") 'insert-date)
\end{minted}

\section{Improvements}
\label{sec:org32bafad}
\subsection{Better beginning of line}
\label{sec:orga32abca}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(defun smarter-move-beginning-of-line (arg)
  "Move point back to indentation of beginning of line.

Move point to the first non-whitespace character on this line.
If point is already there, move to the beginning of the line.
Effectively toggle between the first non-whitespace character and
the beginning of the line.

If ARG is not nil or 1, move forward ARG - 1 lines first.  If
point reaches the beginning or end of the buffer, stop there."
  (interactive "^p")
  (setq arg (or arg 1))

  ;; Move lines first
  (when (/= arg 1)
    (let ((line-move-visual nil))
      (forward-line (1- arg))))

  (let ((orig-point (point)))
    (back-to-indentation)
    (when (= orig-point (point))
      (move-beginning-of-line 1))))

;; remap C-a to `smarter-move-beginning-of-line'
(global-set-key [remap move-beginning-of-line] 'smarter-move-beginning-of-line)
(global-set-key [remap org-beginning-of-line]  'smarter-move-beginning-of-line)
\end{minted}

\section{Terminal}
\label{sec:org03d0dbd}

I have used urxvt for years, and I miss it sometimes, but ansi-term is enough for most of my tasks.
\subsection{Default shell should be zsh}
\label{sec:org3aa3aeb}

I don’t know why this is a thing, but asking me what shell to launch every single time I open a terminal makes me want to slap babies, this gets rid of it. This goes without saying but you can replace bash with your shell of choice.
\begin{minted}[frame=lines,linenos=true]{common-lisp}

(defvar my-term-shell "/usr/bin/zsh")
(defadvice ansi-term (before force-bash)
  (interactive (list my-term-shell)))
(ad-activate 'ansi-term)
\end{minted}

\subsection{Easy to remember keybinding}
\label{sec:org14fe832}

In loving memory of bspwm, Super + Enter opens a new terminal, old habits die hard.
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(global-set-key (kbd "<s-return>") 'eshell)
\end{minted}

\section{Moving around}
\label{sec:orge861b71}

One of the most important things about a text editor is how efficient
you manage to be when using it, how much time do basic tasks take you
and so on and so forth. One of those tasks is moving around files and
buffers, whatever you may use emacs for you will be jumping around
buffers like it’s serious businexss, the following set of enhancements
aims to make it easier.

As a great emacs user once said:

Do me the favor, do me the biggest favor, matter of fact do
yourself the biggest favor and integrate those into your workflow.


\subsection{scrolling and why does the screen move}
\label{sec:org7db6e7e}

I don’t know to be honest, but this little bit of code makes scrolling with emacs a lot nicer.
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq scroll-conservatively 100)
\end{minted}

\subsection{which-key and why I love emacs}
\label{sec:org289f323}

In order to use emacs, you don’t need to know how to use emacs. It’s self documenting, and coupled with this insanely useful package, it’s even easier. In short, after you start the input of a command and stop, pondering what key must follow, it will automatically open a non-intrusive buffer at the bottom of the screen offering you suggestions for completing the command, that’s it, nothing else.

It’s beautiful
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package which-key
  :ensure t
  :diminish which-key-mode
  :config
  (which-key-mode))
\end{minted}

\subsection{windows,panes and why I hate other-window}
\label{sec:orgd068791}

Some of us have large displays, others have tiny netbook screens, but regardless of your hardware you probably use more than 2 panes/windows at times, cycling through all of them with C-c o is annoying to say the least, it’s a lot of keystrokes and takes time, time you could spend doing something more productive.
switch-window

This magnificent package takes care of this issue. It’s unnoticeable if you have <3 panes open, but with 3 or more, upon pressing C-x o you will notice how your buffers turn a solid color and each buffer is asigned a letter (the list below shows the letters, you can modify them to suit your liking), upon pressing a letter asigned to a window, your will be taken to said window, easy to remember, quick to use and most importantly, it annihilates a big issue I had with emacs. An alternative is ace-window, however by default it also changes the behaviour of C-x o even if only 2 windows are open, this is bad, it also works less well with exwm for some reason.
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package switch-window
  :ensure t
  :config
  (setq switch-window-input-style 'minibuffer)
  (setq switch-window-increase 4)
  (setq switch-window-threshold 2)
  (setq switch-window-shortcut-style 'qwerty)
  (setq switch-window-qwerty-shortcuts
        '("a" "s" "d" "f" "j" "k" "l" "i" "o"))
  :bind
  ([remap other-window] . switch-window))
\end{minted}

\subsection{Following window splits}
\label{sec:org5e0ee6e}

After you split a window, your focus remains in the previous one. This annoyed me so much I wrote these two, they take care of it.
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(defun split-and-follow-horizontally ()
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)

(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 3") 'split-and-follow-vertically)

\end{minted}
