config.tex



\subsection{Helm}
\label{sec:org08a78aa}

\begin{verbatim}
(use-package helm
  :ensure t
  :bind
  ("C-x C-f" . 'helm-find-files)
  ("C-x C-b" . 'helm-buffers-list)
  ("M-x" . 'helm-M-x)
  :config
  (defun daedreth/helm-hide-minibuffer ()
    (when (with-helm-buffer helm-echo-input-in-header-line)
      (let ((ov (make-overlay (point-min) (point-max) nil nil t)))
        (overlay-put ov 'window (selected-window))
        (overlay-put ov 'face
                     (let ((bg-color (face-background 'default nil)))
                       `(:background ,bg-color :foreground ,bg-color)))
        (setq-local cursor-type nil))))
  (add-hook 'helm-minibuffer-set-up-hook 'daedreth/helm-hide-minibuffer)
  (setq helm-autoresize-max-height 0
        helm-autoresize-min-height 40
        helm-M-x-fuzzy-match t
        helm-buffers-fuzzy-matching t
        helm-recentf-fuzzy-match t
        helm-semantic-fuzzy-match t
        helm-imenu-fuzzy-match t
        helm-split-window-in-side-p nil
        helm-move-to-line-cycle-in-source nil
        helm-ff-search-library-in-sexp t
        helm-scroll-amount 8 
        helm-echo-input-in-header-line t)
  :init
  (helm-mode 1))

(require 'helm-config)    
(helm-autoresize-mode 1)
(define-key helm-find-files-map (kbd "C-b") 'helm-find-files-up-one-level)
(define-key helm-find-files-map (kbd "C-f")
'helm-execute-persistent-action)

(global-set-key (kbd "M-y") 'helm-show-kill-ring)
(global-set-key (kbd "C-x b") 'helm-mini)

\end{verbatim}


\subsection{Avy}
\label{sec:org9a77ebf}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package avy
  :ensure t
  :bind
  ("M-s" . avy-goto-char-timer))
\end{minted}

\subsection{Swoop}
\label{sec:orgdac3f42}
\begin{minted}[frame=lines,linenos=true]{common-lisp}

(use-package helm-swoop
  :bind (("C-c h o" . helm-swoop)
         ("C-c s" . helm-multi-swoop-all))
  :config
  ;; When doing isearch, hand the word over to helm-swoop
  (define-key isearch-mode-map (kbd "M-i") 'helm-swoop-from-isearch)

  ;; From helm-swoop to helm-multi-swoop-all
  (define-key helm-swoop-map (kbd "M-i") 'helm-multi-swoop-all-from-helm-swoop)

  ;; Save buffer when helm-multi-swoop-edit complete
  (setq helm-multi-swoop-edit-save t)

  ;; If this value is t, split window inside the current window
  (setq helm-swoop-split-with-multiple-windows t)

  ;; Split direcion. 'split-window-vertically or 'split-window-horizontally
  (setq helm-swoop-split-direction 'split-window-vertically)

  ;; If nil, you can slightly boost invoke speed in exchange for text color
  (setq helm-swoop-speed-or-color t))

\end{minted}

\subsection{Winner mode}
\label{sec:org057ae62}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package winner
  :ensure t
  :init (winner-mode 1))
\end{minted}

\section{Completion}
\label{sec:org6d8fe5c}

\subsection{Recentf}
\label{sec:orgb9a1a8c}
\begin{minted}[frame=lines,linenos=true]{common-lisp}

     (use-package recentf
       :init
       (setq recentf-max-menu-items 25
             recentf-auto-cleanup 'never
             recentf-max-saved-items 50
             recentf-keep '(file-remote-p file-readable-p))
       (recentf-mode 1)
       (let ((last-ido "~/.emacs.d/ido.last"))
         (when (file-exists-p last-ido)
           (delete-file last-ido)))

       :bind ("C-c f r" . recentf-open-files))


(defun ido-recentf-open ()
  "Use `ido-completing-read' to \\[find-file] a recent file"
  (interactive)
  (if (find-file (ido-completing-read "Find recent file: " recentf-list))
      (message "Opening file...")
    (message "Aborting")))

(global-set-key (kbd "C-x C-r") 'ido-recentf-open)




\end{minted}
\subsection{IDO}
\label{sec:orge523921}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package ido
  :ensure t
  :init  (setq ido-enable-flex-matching t
               ido-ignore-extensions t
               ido-use-virtual-buffers t
               ido-everywhere t)
  :config
  (ido-mode 1)
  (ido-everywhere 1)
  (add-to-list 'completion-ignored-extensions ".pyc"))

\end{minted}
ido-completing-read+
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package ido-completing-read+
  :ensure t
  :config
  (ido-ubiquitous-mode))
\end{minted}

FLX package
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package flx-ido
  :ensure t
  :init (setq ido-enable-flex-matching t
              ido-use-faces nil)
  :config (flx-ido-mode 1))

\end{minted}

Vertical mode 
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package ido-vertical-mode
  :ensure t
  :init               ; I like up and down arrow keys:
  (setq ido-vertical-define-keys 'C-n-C-p-up-and-down)
  :config
  (ido-vertical-mode 1))

\end{minted}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(defun ido-sort-mtime ()
  "Reorder the IDO file list to sort from most recently modified."
  (setq ido-temp-list
        (sort ido-temp-list
              (lambda (a b)
                (ignore-errors
                  (time-less-p
                   (sixth (file-attributes (concat ido-current-directory b)))
                   (sixth (file-attributes (concat ido-current-directory a))))))))
  (ido-to-end  ;; move . files to end (again)
   (delq nil (mapcar
              (lambda (x) (and (char-equal (string-to-char x) ?.) x))
              ido-temp-list))))

(add-hook 'ido-make-file-list-hook 'ido-sort-mtime)
(add-hook 'ido-make-dir-list-hook 'ido-sort-mtime)

\end{minted}

\subsection{SMEX}
\label{sec:org684248b}
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package smex
  :ensure t
  :init (smex-initialize)
  :bind ("M-x" . smex)
  ("M-X" . smex-major-mode-commands))

\end{minted}
\subsection{Ivy}
\label{sec:org8242f75}
\begin{minted}[frame=lines,linenos=true]{common-lisp}

(use-package ivy
  :ensure t
  :config
  (setq ivy-use-virtual-buffers t
        enable-recursive-minibuffers t
        ivy-wrap t 
        ivy-count-format "%d/%d "))
\end{minted}


\subsection{Counsel}
\label{sec:orgd29dc36}
Counsel tramp 
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package counsel-tramp
  :ensure t
  )
\end{minted}

\section{Writing}
\label{sec:orgafea673}

\subsection{Flyspell config}
\label{sec:orgd3fdf17}

Installing aspell on linux:

\begin{verbatim}
apt install aspell aspell-en
\end{verbatim}

on mac: 

\begin{verbatim}
brew install aspell 
\end{verbatim}

Note in the config below I assume aspell is installed in \texttt{/usr/bin/} !. 

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package flyspell
  :ensure t
  :diminish flyspell-mode
  :init
  (add-hook 'prog-mode-hook 'flyspell-prog-mode)

  (dolist (hook '(text-mode-hook org-mode-hook))
    (add-hook hook (lambda () (flyspell-mode 1))))

  (dolist (hook '(change-log-mode-hook log-edit-mode-hook org-agenda-mode-hook))
    (add-hook hook (lambda () (flyspell-mode -1))))

  :config
  (setq ispell-program-name "aspell"
        ispell-local-dictionary "en_GB"
        ;;ispell-dictionary "american" ; better for aspellr
        ispell-extra-args '("--sug-mode=ultra" "--lang=en_GB")
        ispell-list-command "--list"
        ispell-local-dictionary-alist '(("en_GB" "[[:alpha:]]" "[^[:alpha:]]" "['‘’]"
                                         t ; Many other characters
                                         ("-d" "en_GB") nil utf-8))))

\end{minted}

There is more stuff in Howard Abram's config but I'll leave this for now..



\subsection{Writegood mode}
\label{sec:org2be6598}
This does not work - there is a wring gpg signature in melpa\ldots{} 

\begin{minted}[frame=lines,linenos=true]{common-lisp}

(when (file-exists-p "/home/user/programs/writegood-mode")
  (message "Loading writegood-mode")
  (add-to-list 'load-path "/home/user/programs/writegood-mode")
  (require 'writegood-mode)
  (add-hook 'text-mode-hook 'writegood-mode)
  (add-hook 'org-mode-hook 'writegood-mode)
  )
\end{minted}

this mode will improve various aspects of writing. 

end.
