config.org
** LangTool
   
   I added the Emacs-langtool code from:
   
   https://github.com/mhayashi1120/Emacs-langtool
   
   To my =/elisp/= directory. 
   
   To install langtool install =maven= package, java 8 then:

   #+BEGIN_EXAMPLE sh
   cd ~/programs
   git clone https://github.com/languagetool-org/languagetool.git
   ./build.sh languagetool-standalone package

   #+END_EXAMPLE
   This does not work! 
   
   I now simply download the pre-compiles zip package... 

   To load: 
   #+BEGIN_SRC emacs-lisp
     (require 'langtool)
     (setq langtool-language-tool-jar "/home/user/programs/langtool/LanguageTool-4.0/languagetool-commandline.jar")
   #+END_SRC
   
* Org-mode
** General setup

   load org mode

   #+BEGIN_SRC emacs-lisp
     (use-package org
       :init
       (setq org-use-speed-commands t
             org-return-follows-link t
             org-completion-use-ido t
             org-outline-path-complete-in-steps nil))
   #+END_SRC
 
   Directory, inbox ..

   #+BEGIN_SRC emacs-lisp
     (setq org-directory "~/")
     (defun org-file-path (filename)
       "Return the absolute address of an org file, given its relative name."
       (concat (file-name-as-directory org-directory) filename))
     (setq org-index-file (org-file-path "/capture/inbox.org"))
     (setq org-archive-location
           (concat (org-file-path "archive.org") "::* From %s"))
   #+END_SRC

   Multiple files for agenda source:

   #+BEGIN_SRC emacs-lisp
     ;;   (setq org-agenda-files (list org-index-file))
     (setq org-agenda-files '("~/capture"
                              "~/work"
                              "~/planning"
                              "~/life"))
   #+END_SRC

   Refile targets / create new targets if necessary

   #+BEGIN_SRC emacs-lisp
     ;;(setq org-refile-targets '((org-agenda-files :maxlevel . 3)))
     (setq org-refile-targets '(("~/work/work-todo.org" :maxlevel . 2)
                                ("~/life/life-todo.org" :maxlevel . 2)
                                ))
     (setq org-refile-use-outline-path 'file)
     (setq org-refile-allow-creating-parent-nodes 'confirm)
     (setq org-refile-allow-creating-parent-nodes 'confirm)
   #+END_SRC

   Drawers 
   #+BEGIN_SRC emacs-lisp
     (setq org-log-into-drawer t)

     ;; Add the REPORT drawer
     (setq org-drawers '("PROPERTIES" "CLOCK" "LOGBOOK" "REPORT"))
   #+END_SRC

   Hitting C-c C-x C-s will mark a todo as done and move it to an appropriate place
   in the archive.

   #+BEGIN_SRC emacs-lisp
     (defun tl/mark-done-and-archive ()
       "Mark the state of an org-mode item as DONE and archive it."
       (interactive)
       (org-todo 'done)
       (org-archive-subtree))

     ;;    (define-key org-mode-map (kbd "C-c C-x C-s") 'tl/mark-done-and-archive)



   #+END_SRC

   Record the time that a todo was archived.

   #+BEGIN_SRC emacs-lisp
     (setq org-log-done 'time)
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
     (add-hook 'org-mode-hook 'visual-line-mode)
   #+END_SRC
** Capture
   Capture templates..
   #+BEGIN_SRC emacs-lisp
     (setq org-capture-templates
           (quote (("t" "todo" entry (file+headline org-index-file "Inbox")
                    "* TODO %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")
                   ("n" "note" entry (file+headline org-index-file "Inbox")
                    "* %?\n\n  %i\n\n  See: %a" :empty-lines 1)
                   ("r" "respond" entry (file+headline org-index-file "Inbox")
                    "* TODO Respond to %:from on %:subject\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")
                   ("m" "Mail" entry (file+headline org-index-file "Inbox")
                    "* TODO %?\n%a   %:from %:fromname %:fromaddress" :prepend t :jump-to-captured t)
                   ("p" "Daily Plan" plain (file+datetree "~/planning/daily-plan.org")
                    "+ [ ] The 3 most important tasks [/]
                     - [ ] 
                     - [ ] 
                     - [ ] 
                   + [ ] Other tasks that are in the system [/]
                     - [ ] 
                   + [ ] ToDos which are not tracked by my system [/]
                     - [ ] " :immediate-finish t)
                   )))
   #+END_SRC

** Taking Meeting Notes

   directly from https://github.com/howardabrams/dot-files/blob/master/emacs-org.org)

   I’ve notice that while I really like taking notes in a meeting, I don’t always like the multiple windows I have opened, so I created this function that I can easily call to eliminate distractions during a meeting.
   #+BEGIN_SRC emacs-lisp

     (defun meeting-notes ()
       "Call this after creating an org-mode heading for where the notes for the meeting
     should be. After calling this function, call 'meeting-done' to reset the environment."
       (interactive)
       (outline-mark-subtree)                              ;; Select org-mode section
       (narrow-to-region (region-beginning) (region-end))  ;; Only show that region
       (deactivate-mark)
       (delete-other-windows)                              ;; Get rid of other windows
       (text-scale-set 3)                                  ;; Text is now readable by others
       (fringe-mode 0)
       (message "When finished taking your notes, run meeting-done."))

   #+END_SRC
   Of course, I need an ‘undo’ feature when the meeting is over…
   #+BEGIN_SRC emacs-lisp
     (defun meeting-done ()
       "Attempt to 'undo' the effects of taking meeting notes."
       (interactive)
       (widen)                                       ;; Opposite of narrow-to-region
       (text-scale-set 0)                            ;; Reset the font size increase
       (fringe-mode 1)
       (winner-undo))                                ;; Put the windows back in place

   #+END_SRC

   End.

** Coding

   Allow babel to evaluate C ...

   #+BEGIN_SRC emacs-lisp
     (org-babel-do-load-languages
      'org-babel-load-languages
      '((C . t)
        (R . t)
        (dot . t)
        (emacs-lisp . t)
        (shell . t) 
        (awk . t)
        (makefile . t)
        (latex .t)
        ))

   #+END_SRC

   Don’t ask before evaluating code blocks.
   #+BEGIN_SRC emacs-lisp

     (setq org-confirm-babel-evaluate nil)

   #+END_SRC

   smart brackets in export

   #+BEGIN_SRC emacs-lisp
     (setq org-export-with-smart-quotes t)
   #+END_SRC

   Done.
** Export

   Export packages...

   #+BEGIN_SRC emacs-lisp
     (require 'ox-latex)
     (require 'ox-beamer)
   #+END_SRC

   Htmlize required for reveal...

   #+BEGIN_SRC emacs-lisp
     (use-package htmlize
       :ensure t)
   #+END_SRC

   Use minted package for code: 

   #+BEGIN_SRC emacs-lisp
     (setq org-latex-listings 'minted)
     (setq org-latex-minted-options
           '(("frame" "lines") ("linenos=true")))

   #+END_SRC
  
** Flyspell
   Enable spell-checking in Org-mode.
   #+BEGIN_SRC emacs-lisp
     (add-hook 'org-mode-hook 'flyspell-mode)
   #+END_SRC

** Color and display
   
   Use syntax highlighting in source blocks while editing.
   #+BEGIN_SRC emacs-lisp
     (setq org-src-fontify-natively t)
   #+END_SRC

   Make TAB act as if it were issued in a buffer of the language’s major mode.
   #+BEGIN_SRC emacs-lisp
     (setq org-src-tab-acts-natively t)
   #+END_SRC

   When editing a code snippet, use the current window rather than popping open a
   new one (which shows the same information).
   #+BEGIN_SRC emacs-lisp
     (setq org-src-window-setup 'current-window)
   #+END_SRC

