config.tex


\subsection{LangTool}
\label{sec:org1401921}

I added the Emacs-langtool code from:

\url{https://github.com/mhayashi1120/Emacs-langtool}

To my \texttt{/elisp/} directory. 

To install langtool install \texttt{maven} package, java 8 then:

\begin{verbatim}
cd ~/programs
git clone https://github.com/languagetool-org/languagetool.git
./build.sh languagetool-standalone package

\end{verbatim}
This does not work! 

I now simply download the pre-compiles zip package\ldots{} 

To load: 
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(require 'langtool)
(setq langtool-language-tool-jar "/home/user/programs/langtool/LanguageTool-4.0/languagetool-commandline.jar")
\end{minted}

\section{Org-mode}
\label{sec:org47caeac}
\subsection{General setup}
\label{sec:orga41f40f}

load org mode

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package org
  :init
  (setq org-use-speed-commands t
        org-return-follows-link t
        org-completion-use-ido t
        org-outline-path-complete-in-steps nil))
\end{minted}

Directory, inbox ..

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq org-directory "~/")
(defun org-file-path (filename)
  "Return the absolute address of an org file, given its relative name."
  (concat (file-name-as-directory org-directory) filename))
(setq org-index-file (org-file-path "/capture/inbox.org"))
(setq org-archive-location
      (concat (org-file-path "archive.org") "::* From %s"))
\end{minted}

Multiple files for agenda source:

\begin{minted}[frame=lines,linenos=true]{common-lisp}
;;   (setq org-agenda-files (list org-index-file))
(setq org-agenda-files '("~/capture"
                         "~/work"
                         "~/planning"
                         "~/life"))
\end{minted}

Refile targets / create new targets if necessary

\begin{minted}[frame=lines,linenos=true]{common-lisp}
;;(setq org-refile-targets '((org-agenda-files :maxlevel . 3)))
(setq org-refile-targets '(("~/work/work-todo.org" :maxlevel . 2)
                           ("~/work/work-todo-archive.org" :maxlevel . 2)
                           ("~/life/life-todo.org" :maxlevel . 2)
                           ))
(setq org-refile-use-outline-path 'file)
(setq org-refile-allow-creating-parent-nodes 'confirm)
(setq org-refile-allow-creating-parent-nodes 'confirm)
\end{minted}

Drawers 
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq org-log-into-drawer t)

;; Add the REPORT drawer
(setq org-drawers '("PROPERTIES" "CLOCK" "LOGBOOK" "REPORT"))
\end{minted}

Hitting C-c C-x C-s will mark a todo as done and move it to an appropriate place
in the archive.

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(defun tl/mark-done-and-archive ()
  "Mark the state of an org-mode item as DONE and archive it."
  (interactive)
  (org-todo 'done)
  (org-archive-subtree))

;;    (define-key org-mode-map (kbd "C-c C-x C-s") 'tl/mark-done-and-archive)



\end{minted}

Record the time that a todo was archived.

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq org-log-done 'time)
\end{minted}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(add-hook 'org-mode-hook 'visual-line-mode)
\end{minted}
\subsection{Capture}
\label{sec:orgbb5c883}
Capture templates..
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq org-capture-templates
      (quote (("t" "todo" entry (file+headline org-index-file "Inbox")
               "* TODO %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")
              ("n" "note" entry (file+headline org-index-file "Inbox")
               "* %?\n\n  %i\n\n  See: %a" :empty-lines 1)
              ("r" "respond" entry (file+headline org-index-file "Inbox")
               "* TODO Respond to %:from on %:subject\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")
              ("m" "Mail" entry (file+headline org-index-file "Inbox")
               "* TODO %?\n%a   %:from %:fromname %:fromaddress" :prepend t :jump-to-captured t)
              ("p" "Daily Plan" plain (file+datetree "~/planning/daily-plan.org")
               "+ [ ] The 3 most important tasks [/]
                - [ ] 
                - [ ] 
                - [ ] 
              + [ ] Other tasks that are in the system [/]
                - [ ] 
              + [ ] ToDos which are not tracked by my system [/]
                - [ ] " :immediate-finish t)
              )))
\end{minted}

\subsection{Taking Meeting Notes}
\label{sec:org6ec902f}

directly from \url{https://github.com/howardabrams/dot-files/blob/master/emacs-org.org})

I’ve notice that while I really like taking notes in a meeting, I don’t always like the multiple windows I have opened, so I created this function that I can easily call to eliminate distractions during a meeting.
\begin{minted}[frame=lines,linenos=true]{common-lisp}

(defun meeting-notes ()
  "Call this after creating an org-mode heading for where the notes for the meeting
should be. After calling this function, call 'meeting-done' to reset the environment."
  (interactive)
  (outline-mark-subtree)                              ;; Select org-mode section
  (narrow-to-region (region-beginning) (region-end))  ;; Only show that region
  (deactivate-mark)
  (delete-other-windows)                              ;; Get rid of other windows
  (text-scale-set 3)                                  ;; Text is now readable by others
  (fringe-mode 0)
  (message "When finished taking your notes, run meeting-done."))

\end{minted}
Of course, I need an ‘undo’ feature when the meeting is over…
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(defun meeting-done ()
  "Attempt to 'undo' the effects of taking meeting notes."
  (interactive)
  (widen)                                       ;; Opposite of narrow-to-region
  (text-scale-set 0)                            ;; Reset the font size increase
  (fringe-mode 1)
  (winner-undo))                                ;; Put the windows back in place

\end{minted}

End.

\subsection{Coding}
\label{sec:orge589d57}

Allow babel to evaluate C \ldots{}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(org-babel-do-load-languages
 'org-babel-load-languages
 '((C . t)
   (R . t)
   (dot . t)
   (emacs-lisp . t)
   (shell . t) 
   (awk . t)
   (makefile . t)
   (latex . t)
   (java . t)
   (clojure . t)
   ))

\end{minted}

Don’t ask before evaluating code blocks.
\begin{minted}[frame=lines,linenos=true]{common-lisp}

(setq org-confirm-babel-evaluate nil)

\end{minted}

smart brackets in export

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq org-export-with-smart-quotes t)
\end{minted}

Done.
\subsection{Export}
\label{sec:orgc9485bb}

Export packages\ldots{}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(require 'ox-latex)
(require 'ox-beamer)
\end{minted}

Htmlize required for reveal\ldots{}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package htmlize
  :ensure t)
\end{minted}

Use minted package for code: 

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq org-latex-listings 'minted)
(setq org-latex-minted-options
      '(("frame" "lines") ("linenos=true")))

\end{minted}

\subsection{Flyspell}
\label{sec:org90a861a}
Enable spell-checking in Org-mode.
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(add-hook 'org-mode-hook 'flyspell-mode)
\end{minted}

\subsection{Color and display}
\label{sec:org1f3b81d}

Use syntax highlighting in source blocks while editing.
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq org-src-fontify-natively t)
\end{minted}

Make TAB act as if it were issued in a buffer of the language’s major mode.
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq org-src-tab-acts-natively t)
\end{minted}

When editing a code snippet, use the current window rather than popping open a
new one (which shows the same information).
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq org-src-window-setup 'current-window)
\end{minted}
