config.tex

\subsection{Image preview}
\label{sec:orgff170d2}

Inline images support:

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq org-latex-create-formula-image-program 'imagemagick)

(add-to-list 'org-latex-packages-alist
             '("" "tikz" t))

(eval-after-load "preview"
  '(add-to-list 'preview-default-preamble "\\PreviewEnvironment{tikzpicture}" t))
(setq org-latex-create-formula-image-program 'imagemagick)


(setq org-confirm-babel-evaluate nil)
(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)   
(add-hook 'org-mode-hook 'org-display-inline-images)
\end{minted}

\subsection{Keybindings}
\label{sec:orga45f1d2}


Standard bindings

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map "\C-ca" 'org-agenda)
(define-key global-map "\C-cc" 'org-capture)
\end{minted}

Quickly open index file
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(defun open-index-file ()
  "Open the master org TODO list."
  (interactive)
  (find-file org-index-file)
  (flycheck-mode -1)
  (end-of-buffer))

(global-set-key (kbd "C-c i") 'open-index-file)
\end{minted}


undef a key

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(add-hook 'org-mode-hook
          '(lambda ()
             ;; Undefine C-c [ and C-c ] since this breaks my
             ;; org-agenda files when directories are include It
             ;; expands the files in the directories individually
             (org-defkey org-mode-map "\C-c[" 'undefined))
          'append)

\end{minted}

\subsection{Org-ref}
\label{sec:orgaa338a4}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package org-ref
  :ensure t)
\end{minted}

Make \texttt{supercite} the default citation type:
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq org-ref-default-citation-link "supercite")
\end{minted}


Define format for bibtex entries


\begin{minted}[frame=lines,linenos=true]{common-lisp}

;; variables that control bibtex key format for auto-generation
;; I want firstauthor-year-title-words
;; this usually makes a legitimate filename to store pdfs under.
(setq bibtex-autokey-year-length 4
      bibtex-autokey-name-year-separator "-"
      bibtex-autokey-year-title-separator "-"
      bibtex-autokey-titleword-separator "-"
      bibtex-autokey-titlewords 2
      bibtex-autokey-titlewords-stretch 1
      bibtex-autokey-titleword-length 5)
\end{minted}

Where are the refs?

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq reftex-default-bibliography '("~/work/bibliography/references.bib"))

;; see org-ref for use of these variables
(setq org-ref-bibliography-notes "~/work/bibliography/notes.org"
      org-ref-default-bibliography '("~/work/bibliography/references.bib")
      org-ref-pdf-directory "~/work/bibliography/bibtex-pdfs/")



\end{minted}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq org-ref-completion-library 'org-ref-ivy-cite)

\end{minted}
End.

\subsection{Latex templates}
\label{sec:org6f6bf4b}
Latex templates
\begin{minted}[frame=lines,linenos=true]{common-lisp}



;;(setq org-latex-to-pdf-process '("xelatex %f && bibtex %f && xelatex %f && xelatex %f"))
(defun sk-latexmk-cmd (backend)
  "When exporting from .org with latex, automatically run latex,
     pdflatex, or xelatex as appropriate, using latexmk."
  (when (org-export-derived-backend-p backend 'latex)
    (let ((texcmd)))
    ;; default command: xelatex
    (setq texcmd "jobname=$(basename %f | sed 's/\.tex//');latexmk -xelatex -shell-escape -quiet %f && mkdir -p latex.d && mv ${jobname}.* latex.d/. && mv latex.d/${jobname}.{org,pdf,fdb_latexmk,aux} .")
    ;; pdflatex -> .pdf
    (if (string-match "LATEX_CMD: pdflatex" (buffer-string))
        (setq texcmd "latexmk -pdflatex='pdflatex -shell-escape -interaction nonstopmode' -pdf -bibtex -f %f"))
    ;; xelatex -> .pdf
    (if (string-match "LATEX_CMD: xelatex" (buffer-string))
        (setq texcmd "latexmk -pdflatex='xelatex -shell-escape -interaction nonstopmode' -pdf -bibtex -f  %f"))
    ;; LaTeX compilation command
    (setq org-latex-pdf-process (list texcmd))))

(org-add-hook 'org-export-before-processing-hook 'sk-latexmk-cmd)

(unless (boundp 'org-latex-classes)
  (setq org-latex-classes nil))
\end{minted}

\subsection{CV}
\label{sec:org403552c}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(add-to-list 'org-latex-classes
             '("CV"
               "\\documentclass[11pt]{article}
     \\usepackage{\\string~\"/.emacs.d/latex_templates/cv\"}
     [NO-DEFAULT-PACKAGES]
     [NO-PACKAGES]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
\end{minted}

\subsection{NHMRC project grant}
\label{sec:orgb1cd690}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(add-to-list 'org-latex-classes
             '("NHMRC_project_grant"
               "\\documentclass[12pt,table,names]{article}
\\usepackage{\\string~\"/.emacs.d/latex_templates/NHMRC_grant\"}
[NO-DEFAULT-PACKAGES]
[NO-PACKAGES]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
\end{minted}
Rebuttal\ldots{} 
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(add-to-list 'org-latex-classes
             '("NHMRC_project_grant_rebuttal"
               "\\documentclass[12pt,table,names]{article}
  \\usepackage{\\string~\"/.emacs.d/latex_templates/NHMRC_grant\"}
  [NO-DEFAULT-PACKAGES]
  [NO-PACKAGES]"
               ("\\subsection{%s}" . "\\section*{%s}")
               ("\\subsubsection{%s}" . "\\subsection*{%s}")q
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

\end{minted}

\subsection{NHMRC Investigator}
\label{sec:orgef76cb5}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(add-to-list 'org-latex-classes
             '("NHMRC_investigator_grant"
               "\\documentclass[12pt,table,names]{article}
\\usepackage{\\string~\"/.emacs.d/latex_templates/NHMRC_investigator\"}
[NO-DEFAULT-PACKAGES]
[NO-PACKAGES]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
\end{minted}

\subsection{ARC Discovery Grant}
\label{sec:org47304dc}

Main grant 
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(add-to-list 'org-latex-classes
             '("ARC_discovery_grant"
               "\\documentclass[12pt]{article}
\\usepackage{\\string~\"/.emacs.d/latex_templates/ARC_discovery\"}
[NO-DEFAULT-PACKAGES]
[NO-PACKAGES]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")))
\end{minted}

Special formatting for the ROPE sections.

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(add-to-list 'org-latex-classes
             '("ARC_ROPE"
               "\\documentclass[12pt]{article}
\\usepackage{\\string~\"/.emacs.d/latex_templates/ARC_discovery_ROPE\"}
[NO-DEFAULT-PACKAGES]
[NO-PACKAGES]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")))
\end{minted}
