config.tex



\subsection{Nature style paper}
\label{sec:org866e518}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(add-to-list 'org-latex-classes '("naturedef"
                                  "\\documentclass[fleqn,10pt]{wlscirep}
 [NO-DEFAULT-PACKAGES]
 [PACKAGES]
 [EXTRA]"
                                  ("\\section{%s}" . "\\section*{%s}")
                                  ("\\subsection{%s}" . "\\subsection*{%s}")
                                  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                                  ("\\paragraph{%s}" . "\\paragraph*{%s}")
                                  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
\end{minted}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(add-to-list 'org-latex-classes
             '("nature"
               "\\documentclass[12pt]{article}
     \\usepackage{\\string~\"/.emacs.d/latex_templates/nature\"}
     [NO-DEFAULT-PACKAGES]
     [NO-PACKAGES]"
               ("\\section*{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
\end{minted}

\subsection{Bioinformatics paper}
\label{sec:orgf8058ed}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(add-to-list 'org-latex-classes '("bioinfo"
                                  "\\documentclass{bioinfo}
 [NO-DEFAULT-PACKAGES]
 [PACKAGES]
 [EXTRA]"
                                  ("\\section{%s}" . "\\section*{%s}")
                                  ("\\subsection{%s}" . "\\subsection*{%s}")
                                  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                                  ("\\paragraph{%s}" . "\\paragraph*{%s}")
                                  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
\end{minted}


\subsection{Internal report}
\label{sec:orga316e65}
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(add-to-list 'org-latex-classes
             '("report"
               "\\documentclass[12pt]{article}
\\usepackage{\\string~\"/.emacs.d/latex_templates/report\"}
[NO-DEFAULT-PACKAGES]
[NO-PACKAGES]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
\end{minted}

\subsection{Simple presentation}
\label{sec:org1a12949}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(add-to-list 'org-latex-classes
             '("simplepresentation"
               "\\documentclass[aspectratio=169,18pt,t]{beamer}
\\usepackage{\\string~\"/.emacs.d/latex_templates/simple\"}
[NO-DEFAULT-PACKAGES]
[NO-PACKAGES]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\begin{frame}[fragile]\\frametitle{%s}"
                "\\end{frame}"
                "\\begin{frame}[fragile]\\frametitle{%s}"
                "\\end{frame}")))
\end{minted}

\subsection{Fancier presentation}
\label{sec:org13dced1}

\begin{minted}[frame=lines,linenos=true]{common-lisp}

(add-to-list 'org-latex-classes
             '("modernpresentation"
               "\\documentclass[14pt]{beamer}
    \\usepackage{\\string~\"/.emacs.d/latex_templates/modern\"}
    [NO-DEFAULT-PACKAGES]
    [NO-PACKAGES]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\begin{frame}[fragile]\\frametitle{%s}"
                "\\end{frame}")))

\end{minted}
end. 

\section{Programming}
\label{sec:orgb80ae5b}

General programming settings..

\subsection{General}
\label{sec:org34238b5}

I like shallow indentation, but tabs are displayed as 8 characters by default. This reduces that.

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq-default tab-width 2)
\end{minted}

Treating terms in CamelCase symbols as separate words makes editing a little
easier for me, so I like to use subword-mode everywhere.
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(global-subword-mode 1)
\end{minted}

Compilation output goes to the \textbf{compilation} buffer. I rarely have that window
selected, so the compilation output disappears past the bottom of the window.
This automatically scrolls the compilation window so I can always see the
output.

\begin{minted}[frame=lines,linenos=true]{common-lisp}

;;(setq compilation-scroll-output t)
(setq compile-command "make")
(setq compilation-scroll-output 'first-error)
(setq compilation-always-kill t)
(setq compilation-disable-input t)
(add-hook 'compilation-mode-hook 'visual-line-mode)

\end{minted}

Flycheck 
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package flycheck
  :ensure t
  :init
  (add-hook 'after-init-hook 'global-flycheck-mode)
  (add-hook 'c-mode-hook (lambda () (setq flycheck-clang-language-standard "c11")))
  :config
  (setq-default flycheck-disabled-checkers '(emacs-lisp-checkdoc)))

\end{minted}

\subsection{Line Numbering}
\label{sec:orgb2d9e82}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package linum-relative
  :ensure t
  :config
  (setq linum-relative-current-symbol "")
  (add-hook 'prog-mode-hook 'linum-relative-mode))
\end{minted}

\subsection{Magit}
\label{sec:orgcfaee21}

I played with this before.. 

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package magit
  :ensure t
  :commands magit-status magit-blame
  :init
  (defadvice magit-status (around magit-fullscreen activate)
    (window-configuration-to-register :magit-fullscreen)
    ad-do-it
    (delete-other-windows))
  :config
  (setq magit-branch-arguments nil
        ;; use ido to look for branches
        magit-completing-read-function 'magit-ido-completing-read
        ;; don't put "origin-" in front of new branch names by default
        magit-default-tracking-name-function 'magit-default-tracking-name-branch-only
        magit-push-always-verify nil
        ;; Get rid of the previous advice to go into fullscreen
        magit-restnore-window-configuration t)

  :bind ("C-x g" . magit-status))

\end{minted}

magit end. 
\subsection{Aggressive Auto Indention}
\label{sec:orgb88a9cc}

Automatically indent without use of the tab found in this article, and seems to be quite helpful for many types of programming languages.

To begin, we create a function that can indent a function by calling indent-region on the beginning and ending points of a function.
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(defun indent-defun ()
  "Indent current defun.
Do nothing if mark is active (to avoid deactivaing it), or if
buffer is not modified (to avoid creating accidental
modifications)."
  (interactive)
  (unless (or (region-active-p)
              buffer-read-only
              (null (buffer-modified-p)))
    (let ((l (save-excursion (beginning-of-defun 1) (point)))
          (r (save-excursion (end-of-defun 1) (point))))
      (cl-letf (((symbol-function 'message) #'ignore))
        (indent-region l r)))))
\end{minted}

Next, create a hook that will call the indent-defun with every command call:

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(defun activate-aggressive-indent ()
  "Locally add `ha/indent-defun' to `post-command-hook'."
  (add-hook 'post-command-hook
            'indent-defun nil 'local))
\end{minted}
