config.org
** Auto Complete
   #+BEGIN_SRC emacs-lisp
     (use-package company-c-headers
       :ensure t
       )

     (use-package company-math 
       :ensure t
       )

     (use-package company-shell 
       :ensure t
       )

     (use-package company
       :ensure t
       :init
       (setq company-dabbrev-ignore-case t
             company-show-numbers t)
       (add-hook 'after-init-hook 'global-company-mode)
       :config
       (setq company-idle-delay 0.05)
       (setq company-minimum-prefix-length 3)
       (setq company-tooltip-align-annotations t)

       (add-to-list 'company-backends 'company-math-symbols-unicode)
       (add-to-list 'company-backends 'company-c-headers)
       ;;(add-to-list 'company-backends 'company-shell)
       :bind ("C-:" . company-complete)  ; In case I don't want to wait
       :diminish company-mode)

     (use-package company-quickhelp
       :ensure t
       :config
       (company-quickhelp-mode 1))

     (add-hook 'c-mode-hook 'company-mode)

     (use-package company-statistics
       :ensure t 
       )

     (with-eval-after-load 'company
       (define-key company-active-map (kbd "M-n") nil)
       (define-key company-active-map (kbd "M-p") nil)
       (define-key company-active-map (kbd "C-n") #'company-select-next)
       (define-key company-active-map (kbd "C-p") #'company-select-previous)
       (define-key company-active-map (kbd "SPC") #'company-abort))

   #+END_SRC

   To make this work properly, I need to manually specify the include paths by
   putting a =.dir-locals.el= into the source directory of my C code. I.e. most
   of the time this will be =src= and I need to point to
   =../tldevel=. 

   In addition add the include path to flycheck-clang! 

   #+BEGIN_EXAMPLE emacs-lisp
   ((c-mode (eval setq company-clang-arguments (append company-clang-arguments '("-I../tldevel")))))
   ((c-mode (eval setq  flycheck-clang-include-path (append  flycheck-clang-include-path '("-I../tldevel")))))      
   #+END_EXAMPLE

** hippie expand


   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "M-/") 'hippie-expand)

     (setq hippie-expand-try-functions-list
           '(try-expand-dabbrev
             try-expand-dabbrev-all-buffers
             try-expand-dabbrev-from-kill
             try-complete-file-name-partially
             try-complete-file-name
             try-expand-all-abbrevs
             try-expand-list
             try-expand-line))
   #+END_SRC

** Yasnippet
   
   #+BEGIN_SRC emacs-lisp
     (use-package yasnippet
       :ensure t
       :diminish
       :init
       (yas-global-mode 1)
       :config
       (use-package yasnippet-snippets
         :ensure t)
       (yas-reload-all));
   #+END_SRC

** Comments
   #+BEGIN_SRC emacs-lisp
     (use-package smart-comment
       :ensure t
       :bind ("M-;" . smart-comment))
   #+End_SRC

** C
*** compile 

    #+BEGIN_SRC emacs-lisp
      (global-set-key (kbd "<f5>") (lambda ()
                                     (interactive)
                                     (setq-local compilation-read-command nil)
                                     (call-interactively 'compile)))

    #+END_SRC

    Follow compilation

    #+BEGIN_SRC emacs-lisp
      (setq compilation-scroll-output t)
    #+END_SRC



*** ggtags


    #+BEGIN_SRC emacs-lisp
      (use-package ggtags
        :ensure t
        :init
        (add-hook 'c-mode-common-hook
                  (lambda ()
                    (when (derived-mode-p 'c-mode)
                      (ggtags-mode 1))))
        :config

                                              ; This must be set to the location of gtags (global)
        ;;(setq ggtags-executable-directory "~/global-6.5.6/bin/")
                                              ; Allow very large database files
        (setq ggtags-oversize-limit 104857600)
        (setq ggtags-sort-by-nearness t)
        (setq ggtags-use-idutils t)
        (setq ggtags-use-project-gtagsconf nil)

        :bind (
               ;;("M-," . gtags-pop-stack)
               ;; ("M-/" . ggtags-find-reference)
               ;;("M-]" . ggtags-idutils-query)

               :map ggtags-navigation-map
                                              ;Ergo
               ("M-u" . ggtags-navigation-previous-file)
               ("M-o" . ggtags-navigation-next-file)
               ("M-l" . ggtags-navigation-visible-mode)
               ("M-j" . ggtags-navigation-visible-mode)
               ("M-k" . next-error)
               ("M-i" . previous-error)
               ) ; end :bind
        )

    #+END_SRC

*** Counsel-gtags

    #+BEGIN_SRC emacs-lisp
      (use-package counsel-gtags
        :ensure t
        ;;:bind (
        ;;   ("M-t" . counsel-gtags-find-definition)
        ;; ("M-r" . counsel-gtags-find-reference)
        ;;("M-s" . counsel-gtags-find-symbol)
        ;; ("M-," . counsel-gtags-go-backward)
        ;; )
        :init 
        (add-hook 'c-mode-hook 'counsel-gtags-mode)
        (add-hook 'c++-mode-hook 'counsel-gtags-mode)
        )

    #+END_SRC

*** Smartparens

    #+BEGIN_SRC emacs-lisp
      (use-package smartparens
        :ensure t
        :config
        (sp-pair "'" nil :actions :rem)
        (sp-pair "`" nil :actions :rem)
        :init (add-hook 'c-mode-hook 'smartparens-mode))




    #+END_SRC

*** smart scan

    #+BEGIN_SRC emacs-lisp
      (use-package smartscan
        :ensure t
        :bind ("M-n" . smartscan-symbol-go-forward)
        ("M-p" . smartscan-symbol-go-backward))

    #+END_SRC
   
** Indenting 

   SET BSD indent style

   #+BEGIN_SRC emacs-lisp

     (add-hook 'c-mode-hook
               '(lambda()
                  (c-set-style "bsd")
                  ))
   #+END_SRC
  
   Whitespace mode

   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-c w") 'whitespace-mode)
     (add-hook 'prog-mode-hook (lambda () (interactive) (setq show-trailing-whitespace 1)))
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
     (setq-default indent-tabs-mode nil)
   #+END_SRC

*** clean aindent mode

    #+BEGIN_SRC emacs-lisp
      (use-package clean-aindent-mode
        :ensure t 

        :init 
        (add-hook 'prog-mode-hook 'clean-aindent-mode)
        )
    #+END_SRC

*** dtrt indent mode

    #+BEGIN_SRC emacs-lisp
      (use-package dtrt-indent 
        :ensure t
        :init 
        (dtrt-indent-mode 1)
        (setq dtrt-indent-verbosity 0)
        )
    #+END_SRC

*** Whitespace bulter 

    #+BEGIN_SRC emacs-lisp
      (use-package ws-butler
        :ensure t 
        :init
        (add-hook 'c-mode-common-hook 'ws-butler-mode)
        )
    #+END_SRC


** Don't ask for permission to run make
   Don't ask with make command to run...
   #+BEGIN_SRC emacs-lisp
     (setq compilation-read-command nil)
   #+END_SRC

** ESS (emacs speaks statistics... ).

   #+BEGIN_SRC emacs-lisp
     (use-package ess
       :ensure t
       :init (require 'ess-site))
   #+END_SRC

* Email 


  #+BEGIN_SRC emacs-lisp
    (require 'starttls)
    (setq starttls-use-gnutls t)

    (require 'smtpmail)
    (setq send-mail-function  'smtpmail-send-it
          message-send-mail-function    'smtpmail-send-it
          starttls-use-gnutls t
          smtpmail-starttls-credentials  '(("smtp.office365.com" 587 nil nil))
          smtpmail-auth-credentials (expand-file-name "~/.authinfo.gpg")
          smtpmail-smtp-server  "smtp.office365.com"
          smtpmail-stream-type  'starttls
          smtpmail-smtp-service 587)

  #+END_SRC

