config.tex

\subsection{Auto Complete}
\label{sec:org2882157}
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package company-c-headers
  :ensure t
  )

(use-package company-math 
  :ensure t
  )

(use-package company-shell 
  :ensure t
  )

(use-package company
  :ensure t
  :init
  (setq company-dabbrev-ignore-case t
        company-show-numbers t)
  (add-hook 'after-init-hook 'global-company-mode)
  :config
  (setq company-idle-delay 0.05)
  (setq company-minimum-prefix-length 3)
  (setq company-tooltip-align-annotations t)

  (add-to-list 'company-backends 'company-math-symbols-unicode)
  (add-to-list 'company-backends 'company-c-headers)
  ;;(add-to-list 'company-backends 'company-shell)
  :bind ("C-:" . company-complete)  ; In case I don't want to wait
  :diminish company-mode)

(use-package company-quickhelp
  :ensure t
  :config
  (company-quickhelp-mode 1))

(add-hook 'c-mode-hook 'company-mode)

(use-package company-statistics
  :ensure t 
  )

(with-eval-after-load 'company
  (define-key company-active-map (kbd "M-n") nil)
  (define-key company-active-map (kbd "M-p") nil)
  (define-key company-active-map (kbd "C-n") #'company-select-next)
  (define-key company-active-map (kbd "C-p") #'company-select-previous)
  (define-key company-active-map (kbd "SPC") #'company-abort))

\end{minted}

To make this work properly, I need to manually specify the include paths by
putting a \texttt{.dir-locals.el} into the source directory of my C code. I.e. most
of the time this will be \texttt{src} and I need to point to
\texttt{../tldevel}. 

In addition add the include path to flycheck-clang! 

\begin{verbatim}
((c-mode (eval setq company-clang-arguments (append company-clang-arguments '("-I../tldevel")))))
((c-mode (eval setq  flycheck-clang-include-path (append  flycheck-clang-include-path '("-I../tldevel")))))      
\end{verbatim}

\subsection{hippie expand}
\label{sec:orgca17fef}


\begin{minted}[frame=lines,linenos=true]{common-lisp}
(global-set-key (kbd "M-/") 'hippie-expand)

(setq hippie-expand-try-functions-list
      '(try-expand-dabbrev
        try-expand-dabbrev-all-buffers
        try-expand-dabbrev-from-kill
        try-complete-file-name-partially
        try-complete-file-name
        try-expand-all-abbrevs
        try-expand-list
        try-expand-line))
\end{minted}

\subsection{Yasnippet}
\label{sec:org3bca3d8}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package yasnippet
  :ensure t
  :diminish
  :init
  (yas-global-mode 1)
  :config
  (use-package yasnippet-snippets
    :ensure t)
  (yas-reload-all));
\end{minted}

\subsection{Comments}
\label{sec:orgd101916}
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package smart-comment
  :ensure t
  :bind ("M-;" . smart-comment))
\end{minted}

\subsection{C}
\label{sec:org59716f6}
\subsubsection{compile}
\label{sec:org158cbe8}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(global-set-key (kbd "<f5>") (lambda ()
                               (interactive)
                               (setq-local compilation-read-command nil)
                               (call-interactively 'compile)))

\end{minted}

Follow compilation

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq compilation-scroll-output t)
\end{minted}



\subsubsection{ggtags}
\label{sec:orgd4fa8a4}


\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package ggtags
  :ensure t
  :init
  (add-hook 'c-mode-common-hook
            (lambda ()
              (when (derived-mode-p 'c-mode)
                (ggtags-mode 1))))
  :config

                                        ; This must be set to the location of gtags (global)
  ;;(setq ggtags-executable-directory "~/global-6.5.6/bin/")
                                        ; Allow very large database files
  (setq ggtags-oversize-limit 104857600)
  (setq ggtags-sort-by-nearness t)
  (setq ggtags-use-idutils t)
  (setq ggtags-use-project-gtagsconf nil)

  :bind (
         ;;("M-," . gtags-pop-stack)
         ;; ("M-/" . ggtags-find-reference)
         ;;("M-]" . ggtags-idutils-query)

         :map ggtags-navigation-map
                                        ;Ergo
         ("M-u" . ggtags-navigation-previous-file)
         ("M-o" . ggtags-navigation-next-file)
         ("M-l" . ggtags-navigation-visible-mode)
         ("M-j" . ggtags-navigation-visible-mode)
         ("M-k" . next-error)
         ("M-i" . previous-error)
         ) ; end :bind
  )

\end{minted}

\subsubsection{Counsel-gtags}
\label{sec:orge97d4ad}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package counsel-gtags
  :ensure t
  ;;:bind (
  ;;   ("M-t" . counsel-gtags-find-definition)
  ;; ("M-r" . counsel-gtags-find-reference)
  ;;("M-s" . counsel-gtags-find-symbol)
  ;; ("M-," . counsel-gtags-go-backward)
  ;; )
  :init 
  (add-hook 'c-mode-hook 'counsel-gtags-mode)
  (add-hook 'c++-mode-hook 'counsel-gtags-mode)
  )

\end{minted}

\subsubsection{Smartparens}
\label{sec:org90adffa}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package smartparens
  :ensure t
  :config
  (sp-pair "'" nil :actions :rem)
  (sp-pair "`" nil :actions :rem)
  :init (add-hook 'c-mode-hook 'smartparens-mode))
\end{minted}

\subsubsection{smart scan}
\label{sec:orgaa3986c}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package smartscan
  :ensure t
  :bind ("M-n" . smartscan-symbol-go-forward)
  ("M-p" . smartscan-symbol-go-backward))

\end{minted}

\subsection{Indenting}
\label{sec:org56dda6d}

SET BSD indent style

\begin{minted}[frame=lines,linenos=true]{common-lisp}

(add-hook 'c-mode-hook
          '(lambda()
             (c-set-style "bsd")
             ))
\end{minted}

Whitespace mode

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(global-set-key (kbd "C-c w") 'whitespace-mode)
(add-hook 'prog-mode-hook (lambda () (interactive) (setq show-trailing-whitespace 1)))
\end{minted}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq-default indent-tabs-mode nil)
\end{minted}

\subsubsection{clean aindent mode}
\label{sec:org9590c9e}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package clean-aindent-mode
  :ensure t 
  :init 
  (add-hook 'prog-mode-hook 'clean-aindent-mode)
  )
\end{minted}

\subsubsection{dtrt indent mode}
\label{sec:org080ab8e}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package dtrt-indent 
  :ensure t
  :init 
  (dtrt-indent-mode 1)
  (setq dtrt-indent-verbosity 0)
  )
\end{minted}

\subsubsection{Whitespace bulter}
\label{sec:org49cbe33}

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package ws-butler
  :ensure t 
  :init
  (add-hook 'c-mode-common-hook 'ws-butler-mode)
  )
\end{minted}


\subsection{Don't ask for permission to run make}
\label{sec:orgd286755}
Don't ask with make command to run\ldots{}
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq compilation-read-command nil)
\end{minted}

\subsection{ESS  (emacs speaks statistics\ldots{} ) and R}
\label{sec:orge796ab4}

I prefer to have my own R installation locally (see Rinstallation.org). Let's let emacs know about this: 

\begin{minted}[frame=lines,linenos=true]{common-lisp}
(setq-default inferior-R-program-name "/home/user/bin/R")
\end{minted}

Default ESS config: 
\begin{minted}[frame=lines,linenos=true]{common-lisp}
(use-package ess
  :ensure t
  :init (require 'ess-site))
\end{minted}


\section{Email}
\label{sec:org386beb2}


\begin{minted}[frame=lines,linenos=true]{common-lisp}
(require 'starttls)
(setq starttls-use-gnutls t)

(require 'smtpmail)
(setq send-mail-function  'smtpmail-send-it
      message-send-mail-function    'smtpmail-send-it
      starttls-use-gnutls t
      smtpmail-starttls-credentials  '(("smtp.office365.com" 587 nil nil))
      smtpmail-auth-credentials (expand-file-name "~/.authinfo.gpg")
      smtpmail-smtp-server  "smtp.office365.com"
      smtpmail-stream-type  'starttls
      smtpmail-smtp-service 587)

\end{minted}
