config.org
** Mu4e 

   On a mac install mu via brew:

   #+BEGIN_EXAMPLE sh
   brew install mu --with-emacs --HEAD
   #+END_EXAMPLE

   and make sure the path below points to the same =HEAD= directory!

   #+BEGIN_EXAMPLE emacs-lisp

     (cond
      ((string-equal system-type "windows-nt") ; Microsoft Windows
       (progn
         (message "Microsoft Windows")))
      ((string-equal system-type "darwin") ; Mac OS X
       (progn
         (add-to-list 'load-path "/usr/local/Cellar/mu/HEAD-7d6c30f/share/emacs/site-lisp/mu/mu4e")
         (setq mu4e-mu-binary "/usr/local/bin/mu")
         ))
      ((string-equal system-type "gnu/linux") ; linux
       (progn
         ;;  (add-to-list 'load-path "~/programs/mu/mu4e")
         (add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")
         (add-to-list 'load-path "/usr/local/share/emacs/site-lisp/mu4e")   
         ;;         (setq mu4e-mu-binary "/usr/local/bin/mu")
         )))

     (message "Loading Mu4e...")

     ;;  (add-to-list 'load-path "~/programs/mu/mu4e")

     ;;         (add-to-list 'load-path "/usr/local/share/emacs/site-lisp/mu/mu4e")   

     ;; the modules
     ;;(if (file-exists-p mu4e-mu-binary)
     ;;    (message "Loading Mu4e...")


     (if (not (require 'mu4e nil t))
         (message "`mu4e' not found")

       ;;(require 'mu4e)
       (require 'org-mu4e)

       (setq mu4e-maildir (expand-file-name "~/Maildir"))

       (setq mu4e-sent-folder "/office365/sent")
       (setq mu4e-drafts-folder "/drafts")
       (setq mu4e-refile-folder "/office365/Archive")   ;; saved messages
       (setq mu4e-trash-folder "/office365/trash")


       (setq message-kill-buffer-on-exit t)
       (setq mu4e-change-filenames-when-moving t)
       (setq mu4e-confirm-quit nil)
       (setq mail-user-agent 'mu4e-user-agent)
       (setq mu4e-completing-read-function 'ivy-completing-read)

       (setq mu4e-sent-messages-behavior 'sent)

       (setq mu4e-view-show-addresses t)

       (setq mu4e-attachment-dir "~/Downloads")


       (define-key mu4e-headers-mode-map (kbd "C-c c") 'org-mu4e-store-and-capture)
       (define-key mu4e-view-mode-map (kbd "C-c c") 'org-mu4e-store-and-capture)

       (setq mu4e-get-mail-command "offlineimap")

       (setq mu4e-compose-signature
             "Associate Professor Timo Lassmann
     Feilman Fellow
     Academic Head of Computational Biology, Telethon Kids Institute
     Adjunct Associate Professor, Center for Child Health Research
     University of Western Australia

     Telethon Kids Institute
     Northern Entrance, Perth Children's Hospital
     15 Hospital Avenue, Nedlands, Western Australia, 6009
     PO Box 855, West Perth, Western Australia, 6872 

     https://scholar.google.com.au/citations?user=7fZs_tEAAAAJ&hl=en

     Visiting Scientist, RIKEN Yokohama Institute, Japan
     Division of Genomic Technology,
     RIKEN Center for Life Science Technologies,
     Yokohama Institute,1-7-22 Suehiro-cho,
     Tsurumi-ku, Yokohama, 230-0045 JAPAN")
       )
   #+END_EXAMPLE



   Spell check 

   #+BEGIN_EXAMPLE emacs-lisp
     (add-hook 'mu4e-compose-mode-hook
               'flyspell-mode)
     (add-hook 'message-mode-hook 'turn-on-orgtbl)
     (add-hook 'message-mode-hook 'turn-on-orgstruct++)
     (add-hook 'mu4e-compose-mode-hook 'turn-off-auto-fill)
   #+END_EXAMPLE
 
* TRAMP

  #+BEGIN_SRC emacs-lisp
      (use-package tramp
        :ensure t
        :config
        (with-eval-after-load 'tramp-cache
          (setq tramp-persistency-file-name "~/.emacs.d/tramp"))
        (setq tramp-default-method "ssh")
        (setq tramp-use-ssh-controlmaster-options nil) 
        (message "tramp-loaded"))
  #+END_SRC
 
* Autoinsert templates 
  
  Again from Howards Abrams: 
  #+BEGIN_SRC emacs-lisp
    (use-package autoinsert
      :ensure t
      :init
      (setq auto-insert-directory (tl/emacs-subdirectory "templates/"))
      ;; Don't want to be prompted before insertion:
      (setq auto-insert-query nil)

      (add-hook 'find-file-hook 'auto-insert)
      (auto-insert-mode 1))

  #+END_SRC

  Use yes snippet for templates. 
  
  #+BEGIN_SRC emacs-lisp
    (defun tl/autoinsert-yas-expand()
      "Replace text in yasnippet template."
      (yas-expand-snippet (buffer-string) (point-min) (point-max)))
  #+END_SRC
  
  Set templates
  
  #+BEGIN_SRC emacs-lisp
    (use-package autoinsert 
      :config
      (define-auto-insert "\\.org$" ["default-orgmode.org" tl/autoinsert-yas-expand]))
  #+END_SRC
  
* Eshell

  Set up environment.
  #+BEGIN_SRC emacs-lisp

    (setenv "LD_LIBRARY_PATH" "/usr/local/lib")

    ;;(setenv "PATH"
    ;;        (concat
    ;;         "/usr/local/bin:/usr/local/sbin:"
    ;;         (getenv "PATH")))

  #+END_SRC

  #+BEGIN_SRC emacs-lisp
    (use-package eshell
      :init
      (setq ;; eshell-buffer-shorthand t ...  Can't see Bug#19391
       eshell-scroll-to-bottom-on-input 'all
       eshell-error-if-no-glob t
       eshell-hist-ignoredups t
       eshell-save-history-on-exit t
       eshell-prefer-lisp-functions nil
       eshell-destroy-buffer-when-process-dies t))
  #+END_SRC

  #+BEGIN_SRC emacs-lisp
    (use-package eshell
      :init
      (add-hook 'eshell-mode-hook
                (lambda ()
                  (add-to-list 'eshell-visual-commands "ssh")
                  (add-to-list 'eshell-visual-commands "tail")
                  (add-to-list 'eshell-visual-commands "top"))))
  #+END_SRC

  Alias
  #+BEGIN_SRC emacs-lisp
    (add-hook 'eshell-mode-hook (lambda ()
                                  (eshell/alias "e" "find-file $1")
                                  (eshell/alias "ff" "find-file $1")
                                  (eshell/alias "emacs" "find-file $1")
                                  (eshell/alias "ee" "find-file-other-window $1")

                                  (eshell/alias "gd" "magit-diff-unstaged")
                                  (eshell/alias "gds" "magit-diff-staged")
                                  (eshell/alias "d" "dired $1")

                                  ;; The 'ls' executable requires the Gnu version on the Mac
                                  (let ((ls (if (file-exists-p "/usr/local/bin/gls")
                                                "/usr/local/bin/gls"
                                              "/bin/ls")))
                                    (eshell/alias "ll" (concat ls " -AlohG --color=always")))))
  #+END_SRC

* PDF tools

  
#+BEGIN_SRC emacs-lisp



    (use-package pdf-tools

      :config
      ;; initialise
      (pdf-tools-install)
      ;; open pdfs scaled to fit page
      (setq-default pdf-view-display-size 'fit-page)
      ;; automatically annotate highlights
      (setq pdf-annot-activate-created-annotations t)
      ;; use normal isearch
      (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward))
#+END_SRC
* End


  Run client

  #+BEGIN_SRC emacs-lisp


    (if (daemonp)
        (add-hook 'after-make-frame-functions
                  '(lambda (f)
                     (with-selected-frame f
                       (when (window-system f) (require 'init-client) ))))
      (require 'init-client) )



  #+END_SRC
  
  #+BEGIN_SRC   emacs-lisp
    (require 'init-local nil t)
  #+END_SRC






** Fill Mode
   Automatically wrapping when you get to the end of a line (or the fill-region):


   #+BEGIN_EXAMPLE 




             (use-package fill
               :bind (("C-c T f" . auto-fill-mode)
                      ("C-c T t" . toggle-truncate-lines))
               :init (add-hook 'org-mode-hook 'turn-on-auto-fill)
               :diminish auto-fill-mode)

   #+END_EXAMPLE


   End. 
